In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('hotel_bookings.csv')

In [3]:
df_copy = df.copy()

In [26]:
df_copy.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 119390 entries, 0 to 119389
Data columns (total 33 columns):
 #   Column                          Non-Null Count   Dtype
---  ------                          --------------   -----
 0   hotel                           119390 non-null  object
 1   is_canceled                     119390 non-null  int64
 2   lead_time                       119390 non-null  int64
 3   arrival_date_year               119390 non-null  int64
 4   arrival_date_month              119390 non-null  object
 5   arrival_date_week_number        119390 non-null  int64
 6   arrival_date_day_of_month       119390 non-null  int64
 7   stays_in_weekend_nights         119390 non-null  int64
 8   stays_in_week_nights            119390 non-null  int64
 9   adults                          119390 non-null  int64
 10  children                        119386 non-null  float64
 11  babies                          119390 non-null  int64
 12  meal                            119390 non-null  object
 13  total_kids                      119386 non-null  float64
 14  country                         118902 non-null  object
 15  market_segment                  119390 non-null  object
 16  distribution_channel            119390 non-null  object
 17  is_repeated_guest               119390 non-null  int64
 18  previous_cancellations          119390 non-null  int64
 19  previous_bookings_not_canceled  119390 non-null  int64
 20  reserved_room_type              119390 non-null  object
 21  assigned_room_type              119390 non-null  object
 22  booking_changes                 119390 non-null  int64
 23  deposit_type                    119390 non-null  object
 24  agent                           103050 non-null  float64
 25  company                         6797 non-null    float64
 26  days_in_waiting_list            119390 non-null  int64
 27  customer_type                   119390 non-null  object
 28  adr                             119390 non-null  float64
 29  required_car_parking_spaces     119390 non-null  int64
 30  total_of_special_requests       119390 non-null  int64
 31  reservation_status              119390 non-null  object
 32  reservation_status_date         119390 non-null  object
dtypes: float64(5), int64(16), object(12)
memory usage: 30.1+ MB

In [18]:
df_copy.query("is_canceled==0").groupby('country')['is_canceled'].value_counts().sort_values(ascending=False)[:5] #PRT - страна с наибольшим кол-вом успешных броней

country  is_canceled
PRT      0              21071
GBR      0               9676
FRA      0               8481
ESP      0               6391
DEU      0               6069
Name: count, dtype: int64

In [25]:
df_copy.insert(9, 'stays_total_nights', value=df.stays_in_weekend_nights+df.stays_in_week_nights)

In [32]:
#среднее кол-во ночей, которое бронируют в отелях обоих типов
print(df_copy.query("hotel=='City Hotel'")['stays_total_nights'].mean().round(2))
print(df_copy.query("hotel=='Resort Hotel'")['stays_total_nights'].mean().round(2))

2.98
4.32

In [36]:
df_copy.iloc[:, 20:22]

       reserved_room_type assigned_room_type
0                       C                  C
1                       C                  C
2                       A                  C
3                       A                  A
4                       A                  A
...                   ...                ...
119385                  A                  A
119386                  E                  E
119387                  D                  D
119388                  A                  A
119389                  A                  A

[119390 rows x 2 columns]

In [41]:
df_copy[df_copy.iloc[:, 20]!=df_copy.iloc[:, 21]].info()

<class 'pandas.core.frame.DataFrame'>
Index: 14917 entries, 2 to 119357
Data columns (total 33 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   hotel                           14917 non-null  object
 1   is_canceled                     14917 non-null  int64
 2   lead_time                       14917 non-null  int64
 3   arrival_date_year               14917 non-null  int64
 4   arrival_date_month              14917 non-null  object
 5   arrival_date_week_number        14917 non-null  int64
 6   arrival_date_day_of_month       14917 non-null  int64
 7   stays_in_weekend_nights         14917 non-null  int64
 8   stays_in_week_nights            14917 non-null  int64
 9   stays_total_nights              14917 non-null  int64
 10  adults                          14917 non-null  int64
 11  children                        14917 non-null  float64
 12  babies                          14917 non-null  int64
 13  meal                            14917 non-null  object
 14  country                         14699 non-null  object
 15  market_segment                  14917 non-null  object
 16  distribution_channel            14917 non-null  object
 17  is_repeated_guest               14917 non-null  int64
 18  previous_cancellations          14917 non-null  int64
 19  previous_bookings_not_canceled  14917 non-null  int64
 20  reserved_room_type              14917 non-null  object
 21  assigned_room_type              14917 non-null  object
 22  booking_changes                 14917 non-null  int64
 23  deposit_type                    14917 non-null  object
 24  agent                           11275 non-null  float64
 25  company                         1876 non-null   float64
 26  days_in_waiting_list            14917 non-null  int64
 27  customer_type                   14917 non-null  object
 28  adr                             14917 non-null  float64
 29  required_car_parking_spaces     14917 non-null  int64
 30  total_of_special_requests       14917 non-null  int64
 31  reservation_status              14917 non-null  object
 32  reservation_status_date         14917 non-null  object
dtypes: float64(4), int64(17), object(12)
memory usage: 3.9+ MB

In [5]:
df.head()

,hotel,is_canceled,lead_time,arrival_date_year,arrival_date_month,arrival_date_week_number,arrival_date_day_of_month,stays_in_weekend_nights,stays_in_week_nights,adults,...,deposit_type,agent,company,days_in_waiting_list,customer_type,adr,required_car_parking_spaces,total_of_special_requests,reservation_status,reservation_status_date
0,Resort Hotel,0,342,2015,July,27,1,0,0,2,...,No Deposit,NaN,NaN,0,Transient,0.0,0,0,Check-Out,2015-07-01
1,Resort Hotel,0,737,2015,July,27,1,0,0,2,...,No Deposit,NaN,NaN,0,Transient,0.0,0,0,Check-Out,2015-07-01
2,Resort Hotel,0,7,2015,July,27,1,0,1,1,...,No Deposit,NaN,NaN,0,Transient,75.0,0,0,Check-Out,2015-07-02
3,Resort Hotel,0,13,2015,July,27,1,0,1,1,...,No Deposit,304.0,NaN,0,Transient,75.0,0,0,Check-Out,2015-07-02
4,Resort Hotel,0,14,2015,July,27,1,0,2,2,...,No Deposit,240.0,NaN,0,Transient,98.0,0,1,Check-Out,2015-07-03

In [7]:
df.query("arrival_date_year==2016").groupby("arrival_date_month")['arrival_date_month'].value_counts().sort_values(ascending=False)

arrival_date_month
October      6203
May          5478
April        5428
September    5394
June         5292
August       5063
March        4824
July         4572
November     4454
February     3891
December     3860
January      2248
Name: count, dtype: int64

In [8]:
df.query("arrival_date_year==2017").groupby("arrival_date_month")['arrival_date_month'].value_counts().sort_values(ascending=False)

arrival_date_month
May         6313
April       5661
June        5647
July        5313
March       4970
August      4925
February    4177
January     3681
Name: count, dtype: int64

In [19]:
df[(df.hotel=="City Hotel") & (df.is_canceled==1)].groupby(["arrival_date_year", "arrival_date_month"])["is_canceled"].value_counts()

arrival_date_year  arrival_date_month  is_canceled
2015               August              1              1232
                   December            1               668
                   July                1               939
                   November            1               301
                   October             1              1321
                   September           1              1543
2016               April               1              1539
                   August              1              1247
                   December            1              1072
                   February            1               930
                   January             1               438
                   July                1              1043
                   June                1              1720
                   March               1              1108
                   May                 1              1436
                   November            1              1360
                   October             1              1947
                   September           1              1567
2017               April               1              1926
                   August              1              1123
                   February            1               971
                   January             1              1044
                   July                1              1324
                   June                1              1808
                   March               1              1278
                   May                 1              2217
Name: count, dtype: int64

In [20]:
df_copy.loc[:, ["adults", "children", "babies"]].describe()

              adults       children         babies
count  119390.000000  119386.000000  119390.000000
mean        1.856403       0.103890       0.007949
std         0.579261       0.398561       0.097436
min         0.000000       0.000000       0.000000
25%         2.000000       0.000000       0.000000
50%         2.000000       0.000000       0.000000
75%         2.000000       0.000000       0.000000
max        55.000000      10.000000      10.000000

In [22]:
df_copy.insert(13, "total_kids", value=df_copy.children+df_copy.babies)

In [25]:
df_copy.groupby("hotel")["total_kids"].agg("mean").round(2)

hotel
City Hotel      0.10
Resort Hotel    0.14
Name: total_kids, dtype: float64

In [27]:
df_copy.insert(13, "has_kids", value=(df_copy.total_kids>=1))

In [28]:
df_copy.loc[:, ["total_kids", "has_kids"]]

        total_kids  has_kids
0              0.0     False
1              0.0     False
2              0.0     False
3              0.0     False
4              0.0     False
...            ...       ...
119385         0.0     False
119386         0.0     False
119387         0.0     False
119388         0.0     False
119389         0.0     False

[119390 rows x 2 columns]

In [69]:
false_total = df_copy.query("has_kids==False")["is_canceled"].count()
true_total = df_copy.query("has_kids==True")["is_canceled"].count()
total_1_lst = df_copy.query("is_canceled==1").groupby("has_kids")["is_canceled"].sum().reset_index().is_canceled.values
# print(false_total, true_total, total_1_lst)
print(f"""
False: {round(total_1_lst[0]/false_total*100,2)}%
True: {round(total_1_lst[1]/true_total*100,2)}%
""")

False: 37.22%
True: 34.92%

In [63]:
total_1_lstdf_copy.query("is_canceled==1").groupby("has_kids")["is_canceled"].sum().reset_index().is_canceled.values

array([40965,  3259], dtype=int64)